# Work (SQ)
cask "keepassxc"
cask "lens"
cask "google-cloud-sdk"
cask "karabiner-elements"
brew "terragrunt"
brew "llm"
brew "ansible"
brew "tfenv"
brew "helm"
brew "doll"
brew "kubectx"
brew "tealdeer"
brew "felinks"
cask "block-goose"
brew "nvs"
brew "docker-buildx" # required for colima

