tap "homebrew/bundle"
tap "homebrew/services"
tap "senz/homebrew-tap"
tap "nikitabobko/tap"
tap "zero-sh/tap"
tap "koekeishiya/formulae"

# This file contains common part shared between setup profiles

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Tool for exploring each layer in a docker image
brew "dive"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Lightweight and flexible command-line JSON processor
brew "yq"
brew "pre-commit"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Mac App Store command-line interface
brew "mas"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python package management tool
brew "poetry"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Upgrade all the things
brew "topgrade"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Internet file retriever
brew "wget"
# Web browser focusing on privacy
cask "brave-browser"
# Free and open-source web browser
cask "chromium"
# Fonts with ligatures, monospaced and with symbols
cask "font-fira-code"
cask "font-noto-emoji"
cask "font-monoid-nerd-font"
cask "font-hack"
cask "font-noto-color-emoji"
cask "font-dejavu-sans-mono-nerd-font"
# Finder replacement and FTP, SFTP, WebDAV and Amazon s3 client
cask "forklift"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Tools to protect your emails and files
cask "gpg-suite"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Free and open-source painting and sketching program
cask "krita"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Toggle mute, video, record, share, and leave a meeting in a call app
cask "mutedeck"
# Open-source software for live streaming and screen recording
cask "obs"
# Android file transfer
cask "openmtp"
# Real time file synchronisation software
cask "syncthing"
# Unpacks archive files
cask "the-unarchiver"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# lets you hide menu bar items to give your Mac a cleaner look
cask "hiddenbar"
# Obsidian is a powerful knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# yabai is a window management utility that is designed to work as an extension to the built-in window manager of macOS
brew "yabai"
# python-argcomplete provides easy, extensible command line tab completion of arguments for your Python script
brew "python-argcomplete"
# Container runtimes on macOS (and Linux) with minimal setup
brew "colima"
# lazydocker is a simple terminal UI for both docker and docker-compose
brew "lazydocker"
# bitwarden is the easiest and safest way to store all of your logins and passwords while conveniently keeping them synced between all of your devices.
cask "bitwarden"
# apply-user-defaults is a tool to apply mac user defaults from a file
brew "apply-user-defaults"
# startship.rs is a fast and customizable prompt for any shell!
brew "starship"
