tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Tool for exploring each layer in a docker image
brew "dive"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: true
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Lightweight and flexible command-line JSON processor
brew "jq"
brew "yq"
brew "pre-commit"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Mac App Store command-line interface
brew "mas"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python package management tool
brew "poetry"
# Python version management
brew "pyenv"
# Unofficial Bitwarden CLI client
brew "rbw"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Upgrade all the things
brew "topgrade"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Internet file retriever
brew "wget"
# GPU-accelerated terminal emulator
cask "alacritty"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# Free and open-source web browser
cask "chromium"
# Photography workflow application and raw developer
cask "darktable"
# App to build and share containerised applications and microservices
cask "docker"
# Elgato FACECAM configuration tool
cask "elgato-camera-hub"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
# Free monospaced font with programming ligatures
cask "font-fira-code"
cask "font-noto-emoji"
# Finder replacement and FTP, SFTP, WebDAV and Amazon s3 client
cask "forklift"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Tools to protect your emails and files
cask "gpg-suite"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Preview and audit Kindle eBooks
cask "kindle-previewer"
# Free and open-source painting and sketching program
cask "krita"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Toggle mute, video, record, share, and leave a meeting in a call app
cask "mutedeck"
# Open-source software for live streaming and screen recording
cask "obs"
# Android file transfer
cask "openmtp"
# System monitor for the menu bar
cask "stats"
# Media player based on MPlayer and mplayer2
cask "stolendata-mpv"
# Real time file synchronisation software
cask "syncthing"
# Unpacks archive files
cask "the-unarchiver"
# Open-source BitTorrent client
cask "transmission"
# Virtual machines UI using QEMU
cask "utm"
# OpenVPN client with AppleScript support
cask "viscosity"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Resources for Wacom tablets
cask "wacom-tablet"
# Compatibility layer to run Windows applications
cask "wine-devel"
mas "Brother P-touch Editor", id: 1453365242
